[{"name": "Abbaye de Belloc", "description": "Abbaye de Belloc is a French Pyrenees, traditional farmhouse, semi-hard cheese from the Pays Basque region, made from unpasteurized sheep milk, with a fat content of 60%."},
  {"name": "Abbaye du Mont des Cats", "description": "The Abbaye du Mont des Cats cheese is made by monks in a monastery of the same name in the town of Godewaersvelde, in Northern France."},
  {"name": "Abertam", "description": "Abertam is a traditional sheep's milk cheese made in the famous Czech spa town of Karlovy Vary."},
  {"name": "Abondance", "description": "Tomme d'Abondance or Abondance is a medium-sized mountain cheese from the Haute Savoie region of France in the Rhone-Alps."},
  {"name": "Ackawi", "description": "Ackawi (also spelled Akawi, Akkawi, Akawieh, or Ackawi) is a Middle Eastern cheese named after the Aker region of Palestine, where it first originated."},
  {"name": "Acorn", "description": "Acorn cheese is a hard, full fat cheese made entirely from Friesland sheep's milk by Karen and Don Ross at their Little Acorn farmhouse at Bethania in Ceredigion."},
  {"name": "Adelost", "description":"Adelost is a Swedish blue cheese made from cow's milk."},
  {"name": "Affidelice au Chablis", "description": "Given that Affidélice au Chablis is born in Burgundy, it bears a lot of similarity to Epoisses cheese."},
  {"name": "Afuega'l Pitu", "description": "'Afuega’l Pitu' is one of the oldest Spanish cheeses."},
  {"name": "Airag", "description": "Airag, also called Kumis or Ayrag is a fermented dairy product made from raw mare's milk."},
  {"name": "Airedale", "description": "Airedale is a semi-soft gourmet cheese, made by the Whitestone Cheese Company in New Zealand."},
  {"name": "Aisy Cendre", "description": "Aisy Cendre is a traditional French farmhouse cheese made from unpasteurised cow’s milk."},
  {"name": "Allgauer Emmentaler", "description": "This is the German version of Emmentaler cheese which originated in Switzerland."},
  {"name": "Alverca", "description": "Alverca, a soft or semi-hard cheese originates from Portugal."},
  {"name": "Ambert", "description": "Produced in the Auvergne region, Fourme d'Ambert (or simply Ambert) is one of France's oldest cheeses, dating back to the Roman occupation nearly 1,000 years ago."},
  {"name": "American Cheese", "description": "American cheese is processed cheese made from a blend of milk, milk fats and solids, with other fats and whey protein concentrate."},
  {"name": "Ami du Chambertin", "description": "This is a soft French artisan cheese, made from unpasteurised cow's milk."},
  {"name": "Anejo Enchilado", "description": "Añejo Enchilado is a firm, aged Mexican cheese that was originally made from goat's milk but is now commonly made from cow’s milk."},
  {"name": "Anneau du Vic-Bilh", "description": "Anneau du Vic-Bilh is a type of cottage cheese produced in Bigorre, Pyrenees-Atlantiques region of France."},
  {"name": "Anthoriro", "description": "Anthotyros, also known as Anthotiro is a traditional Greek whey cheese prepared from unpasturized sheep’s and goat's milk or mixtures."},
  {"name": "Appenzell", "description": "There are two types of Appenzeller cheese: common (made with skim milk and brine-cured for 12 months and festive (full milk cured with brine as well as pepper and the sediment from the white wine-making process)."},
  {"name": "Aragon", "description": "Aragon is an autonomous community high in the snow-capped Pyrenees along Spain’s border with France."},
  {"name": "Ardi Gasna", "description": "Ardi Gasna, which means \"sheep's cheese\" in Basque, is an unpasteurised French cheese found in Nive valley of the Pyrenees Mountains."},
  {"name": "Ardrahan", "description": "Ardrahan is a semi-soft cheese made from pasteurised cow's milk by Eugene and Mary Burns in Duhallow - a County Cork town located south of Ireland."},
  {"name": "Armenian String", "description": "A string cheese is formed in long strings twisted together."},
  {"name": "Aromes au Gene de Marc", "description": "Aromes au Gene du Marc is a French, traditional farmhouse cheese from the Lyonnais region produced in wine growing regions several months after the last of the vintage."},
  {"name": "Asadero", "description": "Oaxaca, also known as Queso Oaxaca, Asadero or Quesillo is a Mexican name for a semi-soft, white, string-type, Hispanic-style cheese made from cow's milk."},
  {"name": "Asiago", "description": "Asiago, is a cow's milk cheese, produced only on the Asiago plateau in the Veneto foothills in Italy"},
  {"name": "Aubisque Pyrenees", "description": "Aubisque Pyrenees is a semi-hard cheese produced in Toulouse, France."},
  {"name": "Autun", "description": "A Burgundian manufacture, Autun is a tall, cylindrical cone of soft, fresh cheese made from cow’s milk in the summer and a mixture of goat’s and cow's milk in the autumn."},
  {"name": "Avaxtskyr", "description": "Skyr is a soft cheese that is made from the whey of cow's milk."},
  {"name": "Baby Swiss", "description": "Baby Swiss is an American type of cheese that was invented by Alfred Guggisberg and named by his wife in the mid 1960s outside of Charm, Ohio."},
  {"name": "Babybel", "description": "Babybel, a French version of Dutch Edam cheese, is sold internationally by 'The Bel Group, France' since 1952."},
  {"name": "Baguette Laonnaise", "description": "Baguette Laonnaise is a soft washed rind cheese made from cow's milk, in the industrial city of Laon in France."},
  {"name": "Bakers", "description": "Hoop Cheese (also known as Bakers or Red Ring cheese) is a simple, traditional cheese made only from cow's milk, where the whey has been drained out completely and then placed in a round mould called a hoop."},
  {"name": "Baladi", "description": "Baladi is a soft, white cheese originated in the Middle East and produced by La Fromagerie Polyethnique Inc in Lebanon."},
  {"name": "Balaton", "description": "Traditional, creamery, hard cheese made from cow's milk."},
  {"name": "Bandal", "description": "Bandal or Bandel, is an Asian cheese originating in a same-named Portuguese colony located in eastern India."},
  {"name": "Banon", "description": "Coming from the market-town of Banon, just north of Aix in southern France, Banon is a soft unpasteurised cheese made from goat's milk."},
  {"name": "Barry's Bay Cheddar", "description": "Barry's Bay cheese factory on the Banks Peninsula in Canterbury, New Zealand, has many award winning cheeses to its credit. It is a traditional creamery, with cheeses handcrafted in the traditional style."},
  {"name": "Basing", "description": "Basing is a Caerphilly-style organic cheese made from unpasteurised goat's milk at a Lower Basing Farm in Kent."},
  {"name": "Basket Cheese", "description": "Basket cheese is an Arabic style semi-soft cheese made from vegetable rennet and pasteurised cow’s milk."},
  {"name": "Bath Cheese", "description": "Bath Soft cheese is a modern, farmhouse, vegetarian, soft-white cheese made from cow's milk."},
  {"name": "Bavarian Bergkase", "description": "Bavarian Bergkase (Bawarii Bergkäse), also known as Allgauer Bergkase is a hard mountain cheese and the only \"PDO\" (Protected Designation of Origin) cheese from Germany."},
  {"name": "Baylough", "description": "Bay Lough is a cow’s milk cheese invented by husband and wife, Dick and Anne Keating. With no experience in cheese making, the couple struggled a lot before they could produce any palatable cheese."},
  {"name": "Beaufort", "description": "This remarkable cheese was already known in the time of the Romans."},
  {"name": "Beauvoorde", "description": "Beauvoorde is a Belgian semi-hard cheese made from cow's milk."},
  {"name": "Beenleigh Blue", "description": "Beenleigh Blue is a modern, farmhouse, unpasteurised, organic, vegetarian, blue cheese made from sheep's milk."},
  {"name": "Beer Cheese", "description": "König Ludwig Beercheese is a delicate yellow, semi-hard cheese produced from daily-fresh hay-milk, with small holes and matured in fine König Ludwig dark beer which gives a hearty taste."},
  {"name": "Bel Paese", "description": "Bel Paese, meaning ‘beautiful country’ in Italian, is a semi-soft cheese from the Lombardy region."},
  {"name": "Bergader", "description": "Bergader is a German cheese manufacturing company famous for their different varieties of traditional Bavarian cheeses."},
  {"name": "Bergere Bleue", "description": "Bergere Bleue is an artisanal blue cheese made from raw ewe's milk by the Northland Sheep Dairy in United States."},
  {"name": "Berkswell", "description": "Berkswell cheese comes from England. Fletcher family at Ram Hall farm, near Berkswell, West Midlands is famous as an ace producer of Berkswell cheeses."},
  {"name": "Beyaz Peynir", "description": "Traditional, unpasteurised, vegetarian, fresh cheese made from sheep's milk."},
  {"name": "Bierkase", "description": "Bierkase cheese was originated in Germany. Now it is produced in the United States as well."},
  {"name": "Bishop Kennedy", "description": "Bishop Kennedy is named after a 15th century bishop of St Andrews. It originated from the medieval monasteries in France."},
  {"name": "Blarney", "description": "Blarney Castle is a 100% natural grass-fed cheese whose recipe treads 600 years back to Ireland."},
  {"name": "Bleu d'Auvergne", "description": "Bleu d'Auvergne is a French blue cheese named after its place of origin in the Auvergne region of south-central France."},
  {"name": "Bleu de Gex", "description": "Bleu de Gex (also Bleu du Haut-Jura or Bleu de Septmoncel) is a creamy, semi-soft blue cheese made from unpasteurized milk in the Jura region of France"},
  {"name": "Bleu de Laqueuille", "description": "Bleu is a familiar prefix for French blue-veined cheeses. Bleu de Laqueuille cheese was first produced by Antoine Roussel in 1850 in the village of Laqueuille."},
  {"name": "Bleu de Septmoncel", "description": "Bleu de Septmoncel is a creamy, semi-soft blue cheese made from unpasteurized milk in the Jura region of France."},
  {"name": "Bleu Des Causses", "description": "Bleu des Causses is a French blue cheese made from raw milk of Montbeliarde and Aubrac breeds of cow."},
  {"name": "Blue", "description": "Blue cheese is a general classification of cheeses that have had cultures of the mold Penicillium added so that the final product is spotted or veined throughout with blue, or blue-grey mold and carries a distinct smell, either from that or various specially cultivated bacteria."},
  {"name": "Blue Castello", "description": "In 1960s, one of the oldest cheese producing companies of Denmark - Tholstrup Cheese Company initally prepared Blue Castello cheese."},
  {"name": "Blue Rathgore", "description": "Blue Rathgore is a vegetarian cheese that was produced from 1989 until 2000 by the Woodside Dairy in Finaghy, Belfast, Northern Ireland."},
  {"name": "Blue Vein (Australian)", "description": "Australia has made historic progress in producing a variety of Blue Cheeses. The cheesemakers of Australia have been making blue veined cheese for over 70 years."},
  {"name": "Blue Vein Cheeses", "description": "Blue Vein cheeses also called Blue cheese is a generic term used to describe cheese produced with cow's milk, sheep's milk, or goat's milk and ripened with cultures of the mold Penicillium."},
  {"name": "Bocconcini", "description": "Bocconcini, meaning \"little bites\" in Italian, are egg sized Mozzarella cheeses that originated in Naples and were once made only from the milk of water buffaloes."},
  {"name": "Bocconcini (Australian)", "description": "Bocconcini are small balls of fresh mozzarella, an Italian cheese made from buffalo milk but now also made from cow's milk. Soft and fresh they keep for 2 days in brine in the refrigerator."},
  {"name": "Boeren Leidenkaas", "description": "Boeren-Leidse met sleutels (also known as Boeren Leidenkaas ) is traditional farm-made Leidse kaas protected by a PDO (Protected Designation of Origin) certification."},
  {"name": "Bonchester", "description": "Bonchester is a British cheese awarded with a Protected Designation of Origin (PDO)."},
  {"name": "Bosworth", "description": "Bosworth, also known as Bosworth Leaf or Bosworth Ash Log, is an unpasteurised, vegetarian, semi-soft cheese made from goat's milk."},
  {"name": "Bougon", "description": "Bougon cheese, also known as Bougon Sainte-Maure comes from Poitou-Charentes, a region in south-western France."},
  {"name": "Boule Du Roves", "description": "Goats from the Roves breed, found principally in the Mediterranean region produce very little milk."},
  {"name": "Boulette d'Avesnes", "description": "Boulette d'Avesnes is a cow's milk cheese originally produced in Avesnes, a village on the French-Belgian border."},
  {"name": "Boursault", "description": "Originating in the French region of Val-de-Marne, Boursault is a popular triple-cream cheese made from cow's milk."},
  {"name": "Boursin", "description": "Boursin is a creamy, spreadable brand of Gournay cheese invented by Francois Boursin in 1957."},
  {"name": "Bouyssou", "description": "Bouyssou is a French cheese of rectangular shape made from cow's milk. This cheese is only produced by the farmers in the Averyron region of France."},
  {"name": "Bra", "description": "The Italian cheese 'Bra' comes from the town of Bra in Cuneo in the region of Piemonte, Italy."},
  {"name": "Braudostur", "description": "Braudostur is a semi-hard cheese made from cow’s milk and is similar to Edam cheese. This cheese takes at least 16 weeks to mature completely."},
  {"name": "Breakfast Cheese", "description": "Breakfast cheese (renamed as Petite Breakfast) is a cheese from Marin French Cheese Co. located in California, United States."},
  {"name": "Brebis du Lavort", "description": "Brebis du Lavort is a French cheese re-invented and produced by cheese maker Patrick Beaumont and famous chef Pierre Troisgrois at Fromagerie de Terre Dieu in the Auvergne region of France."},
  {"name": "Brebis du Lochois", "description": "The brebis du Lochois, farm cheese, was recently introduced in a region that was previously dominated by goat's milk cheese."},
  {"name": "Brebis du Puyfaucon", "description": "This artisan cheese is produced exclusively on a farm, situated in the Haute Vienne region in France."},
  {"name": "Bresse Bleu", "description": "Bresse Bleu cheese is made from pasteurised, cow's milk in Bresse, Burgundy. This is a soft French cheese, with a bloomy, edible rind and has an aroma of mushrooms."},
  {"name": "Brick", "description": "Brick cheese, is an American cheese from the state of Wisconsin, first made by John Jossi around 1877."},
  {"name": "Brie", "description": "Brie is the best known French cheese and has a nickname \"The Queen of Cheeses\"."},
  {"name": "Brie de Meaux", "description": "Brie de Meaux, named after the town of Meaux, is a French cheese produced in the region of Brie, located 50 kilometers to the east of Paris. Evidence in the chronicles of Charlemagne suggests the tasting of Brie by the Emperor in the year 774."},
  {"name": "Brie de Melun", "description": "Brie de Melun is said to be the ancestor of all Brie's which originated in the region of northern France known as Seine-et-Marne."},
  {"name": "Brillat-Savarin", "description": "Brillat-Savarin is a triple cream dessert cheese that was created by cheese-maker Henri Androuët in the 1930s."},
  {"name": "Brin", "description": "Le Brin cheese originates from Savoie, the Rhone-Alps region in France."},
  {"name": "Brin d' Amour", "description": "Brin d'Amour meaning \"a birth of love\" is a Corsican cheese made from the milk of the Lacaune ewes."},
  {"name": "Brinza (Burduf Brinza)", "description": "Bryndza (from Romanian brânză) is product of a sheep milk cheese made mainly in Slovakia, Romania and Moldova and Serbia, but also in Poland, Ukraine, Hungary and part of Moravia (Moravian Wallachia) in Czech Republic."},
  {"name": "Briquette de Brebis", "description": "The Briquette de Brebis is produced in the Averyon region from the same milk that is used to make the Roquefort and the Pérail."},
  {"name": "Briquette du Forez", "description": "French cheese made from the mixture of cow's and goat's milk. The Briquette du Forez is matured until dry in humid cellars."},
  {"name": "Broccio", "description": "The name ‘brocciu’ relates to the French word ‘brousse,’ which means fresh cheese made from goat or ewe’s milk."},
  {"name": "Brousse du Rove", "description": "The history of Brousse du Rove cheese dates back to about 2000 years! It is believed that it is named after a village to the west of Marseilles where it was produced for the first time."},
  {"name": "Bruder Basil", "description": "Bruder Basil is a smoked Bavarian cheese, originally produced by the Trappist monks in the Abbey of Rotthalmunster."},
  {"name": "Brusselae Kaas (Fromage de Bruxelles)", "description": "Bruxelles Kaas is smooth, sharp and citric, with strong and salty bite. The cheese is regularly washed and dried over a period of at least three months."},
  {"name": "Bryndza", "description": "ryndza is a sheep's milk cheese popular in several mountainous countries of Eastern Europe, especially in Podhale region of Poland and Slovakia."},
  {"name": "Buchette d'Anjou", "description": "Buchette d'Anjou is a modern fresh cheese which originated in an area named 'Anjou' in the Loire Valley, France."},
  {"name": "Buffalo", "description": "Buffalo is an unpasteurised, vegetarian, hard buffalo milk cheese created by Royal English cheese maker Nick Hodgetts."},
  {"name": "Burgos", "description": "Burgos cheese, also known as 'Queso de Burgos', is named after a province with same name in Castille-Leon region of Spain."},
  {"name": "Butte", "description": "This cheese usually has a brick shape with thick, smooth, velvety, white penicillin rind. It takes its name from the shape that resembles a small hillock."},
  {"name": "Butterkase", "description": "Butterkäse (\"butter cheese\" in German) is a semi-soft, cow's milk cheese moderately popular in Germanic Europe, and occasionally seen in the rest of the cheese-eating world."},
  {"name": "Button (Innes)", "description": "Innes Button is an artisanal unpasteurised goat's cheese handcrafted at Highfields Farm Dairy using time-honored traditional craft methods."},
  {"name": "Buxton Blue", "description": "A cousin of Blue Stilton, Buxton Blue is a modern, creamery, blue cheese made from cow's milk."},
  {"name": "Cabecou", "description": "Cabécou is a soft goat milk cheese from the Midi-Pyrenees region of southern France."},
  {"name": "Caboc", "description": "The cheese is shaped into small logs and rolled in toasted pinhead oatmeal."},
  {"name": "Cabrales", "description": "Cabrales (Spanish: queso de Cabrales) is a blue cheese made in the artisan tradition by rural dairy farmers in Asturias, Spain."},
  {"name": "Cachaille", "description": "This cheese comes from the village of Puimichel. It is made by grating dry cheese into an earthenware pot, and adding pepper, olive oil and fresh cheese up to three days old."},
  {"name": "Caciocavallo", "description": "Caciocavallo, which means \"cheese on horseback\", gets its name from the manner in which the cheese is always tied together in a rope and dangled over a wooden board to drain and age."},
  {"name": "Caciotta", "description": "Caciotta describes a wide range of simple, rural cheeses from central Italy that can be made with either ewe's, cow's, goat's, or buffalo's milk."},
  {"name": "Caerphilly", "description": "Caerphilly is a hard, white cheese originating from a town of the same name in South Wales."},
  {"name": "Cairnsmore", "description": "Cairnsmore is a Scottish cheese produced by Galloway Farmhouse Cheese at their Milliaries Farm in Sorbie."},
  {"name": "Calenzana", "description": "Calinzanincu (Calenzana) is a well-known cheese from the Niolo plateau in the northern part of Corsica."},
  {"name": "Cambazola", "description": "Cambozola is a triple cream, brie-style blue cheese made from pasteurised cow's milk in the German region of Allgäu."},
  {"name": "Camembert de Normandie", "description": "Marie Harel, created the original Camembert cheese from raw milk, in Normandy, France, in 1971."},
  {"name": "Canadian Cheddar", "description": "The cheese can be made from raw, pasteurised or thermalized milk to retain more of the flavour-enhancing enzymes."},
  {"name": "Canestrato", "description": "Canestrato di Moliterno is an Italian, hard, pecorino cheese made from sheep and goat milk in the commune of Moliterno."},
  {"name": "Cantal", "description": "Cantal cheese is a type of firm cheese produced in the Auvergne region of central France: more particularly in the département of Cantal as well as in certain adjoining districts."},
  {"name": "Caprice des Dieux", "description": "Over 50 years ago, Caprice des Dieux was developed by Jean-Noël Bongrain, founder of the parent company Bongrain SA."},
  {"name": "Capricorn Goat", "description": "Capricorn Somerset Goat Cheese is made from pasteurised goat's milk at The Lubborn Creamery in Somerset, England."},
  {"name": "Capriole Banon", "description": "O'Banon is a goat's milk cheese in the Capriole line, produced by Judy Schad in the United States."},
  {"name": "Carre de l'Est", "description": "Carré de l'Est is a French cheese that originated from Lorraine, Eastern France."},
  {"name": "Casciotta di Urbino", "description": "Casciotta d'Urbino PDO is a type of casciotta Italian cheese made from 70% sheep's milk and 30% whole cow's milk."},
  {"name": "Cashel Blue", "description": "ane and Louis Grubb have been making the Cashel Blue cheese on their farms since 1984."},
  {"name": "Castellano", "description": "Castigliano (also known as Castellano) is a traditional, creamery, hard cheese made of milk from Churra and Castellana's breeds of sheep."},
  {"name": "Castelmagno", "description": "Castelmagno is a PDO (Protected Designation of Origin) awarded Italian semi-hard, semi-fat blue cheese prepared within the administrative region of the communes of Castelmagno, Pradleves and Monterosso Grana in the province of Cuneo, Piedmont."},
  {"name": "Castelo Branco", "description": "Castelo Branco (Portuguese: Queijo de Castelo Branco) is a cheese named after the city of the same name in Portugal, the main city of the district where it is produced."},
  {"name": "Castigliano", "description": "The fruity tang of the table cheese when served with the classic Spanish quince or membrilla, takes the dish to a completely new level."},
  {"name": "Cathelain", "description": "The name of the cheese means \"goat\" in the old dialect of Savoie. It is a round-shaped cheese with a smooth, slightly sour pâte that melts in the mouth."},
  {"name": "Celtic Promise", "description": "Celtic Promise is an award-winning, Caerphilly type washed-rind cheese made by John Savage of Teifi Farmhouse Cheese in Ceredigion, Wales."},
  {"name": "Cendre d'Olivet", "description": "Olivet Cendré, also called as Cendré d'Olivet, is an artisanal cheese made in the town of Olivet on the Loire River in France."},
  {"name": "Cerney", "description": "Cerney Pyramid is a medium fat soft goat's cheese handmade by artisans in the Cotswolds, just north of Cirencester, England."},
  {"name": "Chabichou", "description": "Chabichou is a traditional soft, unpasteurized, natural-rind French goat cheese (or Fromage de Chèvre) with a firm and creamy texture."},
  {"name": "Chabichou du Poitou", "description": "Chabichou is a traditional soft, unpasteurized, natural-rind French goat cheese (or Fromage de Chèvre) with a firm and creamy texture."},
  {"name": "Chabis de Gatine", "description": "During the cheesemaking, Chabis is not heated or pressed like all other regular cheeses are. So, it is completely natural for the cheese discs to develop a whitish edible mold."},
  {"name": "Chaource", "description": "Chaource is a French cheese, originally manufactured in the village of Chaource in the Champagne-Ardenne region."},
  {"name": "Charolais", "description": "Charolais is artisanal cheese which comes from the granite plains of Charola in region of Bourgogne, France."},
  {"name": "Chaumes", "description": "Chaumes is a soft cheese made in the southwest of France in the village of St Antoine, at the foothills of the French Pyrénées."},
  {"name": "Cheddar", "description": "Cheddar cheese is a relatively hard, off-white sometimes sharp-tasting (i.e., bitter), natural cheese."},
  {"name": "Cheddar Clothbound", "description": "Lactose-Free Clothbound offers a crumbly texture and nutty aroma. The flavor is deeply savory and slightly tangy with caramel sweetness to the finish."},
  {"name": "Cheshire", "description": "Cheshire is a British cheese produced in the English counties of Cheshire and the neighbouring four counties of Denbighshire, Flintshire, Shropshire and Staffordshire."},
  {"name": "Chevres", "description": "Chevre is French for Goat's cheese i.e. cheeses made out of goat's milk. They are popular among elderly and children who are more likely to show low tolerance to cow's milk."},
  {"name": "Chevrotin des Aravis", "description": "Chevrotin des Aravis is a washed rind cheese made similar to a Reblochon, except with goat’s milk."},
  {"name": "Chontaleno", "description": "Chontaleno is a Mexican semi-firm, white cheese with a flavourful, salty taste."},
  {"name": "Civray", "description": "This cheese made from goat's milk ranks among the same family of cheeses as Chabichou."},
  {"name": "Coeur de Camembert au Calvados", "description": "Coeur de Camembert au Calvados, also known as Calva d'Auge, is a Norman cheese from the Lower Normandy region of France. To prepare this variant, the rind of ripened Camembert is delicately scraped off and then soaked in Calvados brandy for 3 to 5 hours."},
  {"name": "Coeur de Chevre", "description": "Coeur de chevre, meaning heart of goat, is a cheese made from the milk of “poitevine” breed of goats."},
  {"name": "Colby", "description": "Colby cheese, originally called Colby Swiss Cheddar is a semi-hard American cheese prepared from cow’s milk."},
  {"name": "Cold Pack", "description": "Cold Pack cheese is produced by blending two or more varieties of fresh and aged natural cheese without the aid of heat."},
  {"name": "Comte", "description": "Comté is a French cheese produced in the Jura Massif region of Eastern France."},
  {"name": "Coolea", "description": "Coolea is a cow's milk cheese produced on the farm of Dick and Sinead Willems in Coolea Co. Cork."},
  {"name": "Cooleney", "description": "The recipe for Cooleeney Farmhouse Cheese was invented by Breda Maher at their premises near Thurles in County Tipperary, Ireland."},
  {"name": "Coquetdale", "description": "Coquetdale cheese is named after the place called 'Coquetdale, Northumberland' in North East England, United Kingdom where it originated from."},
  {"name": "Corleggy", "description": "Corleggy is an Irish raw goat’s milk cheese, produced by Corleggy Cheeses at the County Cavan, Ireland."},
  {"name": "Cornish Pepper", "description": "Round cheese made from cow's milk. This cheese is produced by Lynher Valley Dairy."},
  {"name": "Cotherstone", "description": "Created by Joan and Alwin Cross in Teesdale, Cotherstone cheese is related to Wensleydale and Swaledale, and named after a village and parish in County Durham in England."},
  {"name": "Cotija", "description": "Cotija is a Hispanic-style cheese named after the town of Cotija in the Mexican state of Michoacán."},
  {"name": "Cottage Cheese", "description": "Cottage cheese has a mild flavour and is a cheese curd product. The curd is drained but not pressed, so some whey remains and retains moisture."},
  {"name": "Cottage Cheese (Australian)", "description": "Cottage Cheese, sometimes known as Baker’s Cheese, is of European origin but is a popular ingredient in Australian cuisine. A type of fresh, unripened cheese, it is mostly made from cow’s milk."},
  {"name": "Cougar Gold", "description": "Cougar Gold cheese is an American cheese produced at the Washington State University Creamery in Pullman, Washington."},
  {"name": "Coulommiers", "description": "Coulommiers cheese is named after 'Coulommiers' commune in the Seine-et-Marne department from France, as this is the place where it was produced for the first time!"},
  {"name": "Coverdale", "description": "Coverdale is an English cheese made by Wensleydale Dairy Products in North Yorkshire."},
  {"name": "Crayeux de Roncq", "description": "Crayeux de Roncq, also spelt as Carré du Vinage, is a washed rind cheese prepared from raw cow's milk in the Roncq region of Northern France, about 30 kms from Lille."},
  {"name": "Cream Cheese", "description": "Cream cheese is a fresh, soft mild tasting cheese produced from unskimmed cow’s milk."},
  {"name": "Cream Havarti", "description": "Denmark's most famous cheese, Cream Havarti is a deliciously mild, very creamy, natural, semi-soft cheese."},
  {"name": "Crema Agria", "description": "Crema Agria is a Mexican style sour cream which is prepared by fermenting fresh pasteurised cream until it is thick and stiff."},
  {"name": "Crema Mexicana", "description": "Crema Mexicana or Mexican Cream is Mexican cultured, sour cream cheese prepared with pasteurised milk."},
  {"name": "Creme Fraiche", "description": "Crème fraîche is a dairy product, a soured cream containing 10–45% butterfat, with a pH of around 4.5."},
  {"name": "Crescenza", "description": "Crescenza cheese, also known as Stracchino, is a type of Italian fresh cheese, typical of Lombardy, Piedmont, and Veneto."},
  {"name": "Croghan", "description": "Croghan is a semi-soft, white rind Italian cheese manufactured from goat's milk."},
  {"name": "Crottin de Chavignol", "description": "Crottin de Chavignol cheese originates from Loire, Chavignol in France."},
  {"name": "Crowdie", "description": "Crowdie is a low-fat, vegetarian Scottish cheese made from cow's milk."},
  {"name": "Crowley", "description": "Named after its inventor, Winfield Crowley and officially designated as a Colby cheese, Crowley is being made in the United States since 1824."},
  {"name": "Cuajada", "description": "The word 'Cuajada' means 'curdled' in Spanish. Famous in the north-eastern regions of Spain, earlier it was made from ewe's milk, but it is industrially made from cow's milk at present."},
  {"name": "Curd", "description": "Cheese curds, in cuisine or cooking, are the solid pieces of curdled milk either eaten alone as a snack, or used in various regional dishes."},
  {"name": "Cure Nantais", "description": "Cure Nantais cheese is also known as 'Nantais'. Its history dates back to French revolution."},
  {"name": "Curworthy", "description": "Introduced and produced by Rachel Stevens on her own farm, Curworthy cheese comes in two variations: Meldon and Belston."},
  {"name": "Cwmtawe Pecorino", "description": "This cheese is made from unpasteurised sheep's milk and was introduced by Giovanni Irranca on his farm."},
  {"name": "Cypress Grove Chevre", "description": "Cypress Grove Chevre is a Californian company that specializes in making artisanal goat cheeses."},
  {"name": "Danablu (Danish Blue)", "description": "Danablu (Danish Blue) is a semi-soft blue veined cheese, made from cow's milk. Produced by Rosenborg at Denmark, it has creamy and crumbly texture."},
  {"name": "Danbo", "description": "t is a rectangular cheese with smooth, dry, yellow rind and sometimes is covered in red wax."},
  {"name": "Danish Fontina", "description": "Danish Fontina is pale yellow and semi-soft with a mild slightly sweet flavour."},
  {"name": "Daralagjazsky", "description": "Made of cow’s or sheep’s milk, Daralagjazsky is one of the famous soft cheeses in Russia. Suitable for vegetarians and paired with Sauvignon Blanc."},
  {"name": "Dauphin", "description": "The cheese was named after an heir to the throne of France."},
  {"name": "Delice des Fiouves", "description": "This cheese is made solely within the Doubs region of France. It can be consumed only in autumn as the milk comes from the summer-grazing cows."},
  {"name": "Denhany Dorset Drum", "description": "Denhany Dorset Drum is a small version of the traditional Denhay Cheddar that won a silver medal at the British Cheese Awards."},
  {"name": "Derby", "description": "Derby is a traditional British cheese made in Derbyshire, England since the 16th century."},
  {"name": "Dessertnyj Belyj", "description": "A soft cow’s milk cheese, Dessertnyj Belyj is produced in Russia. With a fat contnet of 40%, it is a cheese for non-vegetarians. The cheese can be paired with Riesling."},
  {"name": "Devon Blue", "description": "Made by Ben Harris & Robin Congden of the Ticklemore Cheese Co. Devon Blue is a semi-hard blue cheese made using vegetarian rennet and unpasteurised milk from the farm's own herd of Ayreshire cows."},
  {"name": "Devon Garland", "description": "Devon Garland is an unpasteurised, firm and vegetarian cow's milk cheese from England. A Caerphilly style cheese, the cheese develops a natural gray crust rind with a firm, smooth touch. "},
  {"name": "Dolcelatte", "description": "Dolcelatte literally translated name means \"sweet milk\". For the first time, it was made by the Galbani Company, which is a part of Groupe Lactalis at present."},
  {"name": "Doolin", "description": "The cheese has a wheel shape with smooth, hard, golden-yellow, waxed rind. It is a vegetarian, hard cheese made from cow's milk."},
  {"name": "Doppelrhamstufel", "description": "The word ‘Doppelrhamstufel’ means Cream cheese. It is a soft, German cheese made with \"double cream\". It has a mildly lactic aroma and a slightly salty taste."},
  {"name": "Dorset Blue Vinney", "description": "Dorset Blue Vinny is a British cheese made in Dorset from unpasteurised cow's milk."},
  {"name": "Double Gloucester", "description": "Double Gloucester is a traditional, full fat, hard cheese made from pasteurised or unpasteurised cow's milk."},
  {"name": "Double Worcester", "description": "Double Worcester is a tasty and smaller variation of Double Gloucester made by Colin and Alyson Anstey on their Broomhill Farm in Worcester."},
  {"name": "Dreux a la Feuille", "description": "Dreux a la Feuille, also spelt as Feuille de Dreux is a creamy, soft French cheese made from cow’s milk in the Eure-et-Loir area."},
  {"name": "Dry Jack", "description": "Dry Monterey Jack is an aged version of the Monterey Jack that originated in the United States in mid 1950s."},
  {"name": "Duddleswell", "description": "Duddleswell is a high fat sheep’s cheese made at the High Weald Dairy in West Sussex, United Kingdom."},
  {"name": "Dunbarra", "description": "Made of cow’s milk, it’s a creamy semi-soft cheese with a slight pepper taste."},
  {"name": "Dunlop", "description": "Dunlop is a traditional hard Scottish cheese made from pasteurised cow's milk of Ayrshire breed."},
  {"name": "Dunsyre Blue", "description": "Dunsyre Blue is a mould ripened, handmade cheese from H.J. Errington farms in Lanarkshire, Scotland."},
  {"name": "Duroblando", "description": "Duroblando, correctly spelt as Duro Blando is a Hispanic cheese introduced by the Spanish in the 15th century."},
  {"name": "Durrus", "description": "Durrus is an Irish cheese of round shape with powdery pink-orange colour rind."},
  {"name": "Dutch Mimolette (Commissiekaas)", "description": "This cheese looks like giant orange with rough, pitted skin. It is creamery, hard cheese made from cow's milk and it is actually a matured Edam coloured with carrot juice."},
  {"name": "Edam", "description": "The Edam cheese was first produced in Netherlands after the town in which is made."},
  {"name": "Edelpilz", "description": "Edelpilz is a German blue vein cheese made from cow’s milk similar to Danish Blue."},
  {"name": "Emental Grand Cru", "description": "Emental Grand Cru, also spelled as Emmental Grand Cru, originates from Switzerland."},
  {"name": "Emlett", "description": "It is soft-white, smooth and cream cheese produced by Mary Holbrook of Sleight Farm."},
  {"name": "Emmental", "description": "This cheese is produced in the central cantons of Switzerland. It is a traditional, unpasteurised, hard cheese made from cow's milk."},
  {"name": "Epoisses de Bourgogne", "description": "Epoisses de Bourgogne is a soft cow’s milk cheese produced by Jacques Hennart in the village Époisses, France."},
  {"name": "Esbareich", "description": "Esbareich is a round-shaped cheese produced in the Lourse valley in Bigorre region of southwest France."},
  {"name": "Esrom", "description": "Esrom , or Danish Port Salut cheese is a trappist-style traditional, creamery, semi-soft cheese made from cow's milk."},
  {"name": "Etorki", "description": "Etorki, meaning “origin” in Basque language, is a pasteurised sheep’s milk cheese made in French Basque region of the Pyrénées."},
  {"name": "Evansdale Farmhouse Brie", "description": "Made by Evansdale Cheese in Waikouaiti, New Zealand, Evansdale Farmhouse Brie was developed by Colin and Evansdale 30 years ago."},
  {"name": "Evora De L'Alentejo", "description": "Queijo de Evora or Evora is a DOP protected semi hard-unpasteurised sheep’s milk cheese from the town of Evora in Southern Portugal."},
  {"name": "Exmoor Blue", "description": "Exmoor Blue is a semi-soft, full fat, creamy blue cheese made on the farms of Exmoor Blue Cheese Ltd at their Somerset premises."},
  {"name": "Explorateur", "description": "L'Explorateur is a soft-ripened French cow's milk cheese produced by Fromagerie du Petit Morin in Île-de-France."},
  {"name": "Feta", "description": "Feta is undoubtedly one of the most famous Greek cheeses."},
  {"name": "Feta (Australian)", "description": "Australian feta is made from cow's milk (Friesians) and is classed as a soft cheese."},
  {"name": "Figue", "description": "Chèvre Figue à la Rose is a goat's cheese made in the French region of Provence."},
  {"name": "Filetta", "description": "Filleta, also spelt as 'A filetta' is an artisanal, unpasteurised Corscian sheep's milk cheese decorated with sprig of fern, which also gives it its name."},
  {"name": "Fin-de-Siecle", "description": "Fin-de-Siecle is a soft cheese made from cow's milk, produced in Pays de Bray, France. With flowered rind triple-crème, it has a creamy texture."},
  {"name": "Finlandia Swiss", "description": "Finlandia Swiss Cheese is the gold standard in sliced, deli style Swiss cheese."},
  {"name": "Finn", "description": "Finn is an unpasteurised, soft-white cheese produced by Charlie Westhead of Neal's Yard Creamery."},
  {"name": "Fiore Sardo", "description": "Fiore Sardo DOP also known as Pecorino Sardo is a raw, hard cheese made from whole sheep’s milk on the Italian island of Sardinia."},
  {"name": "Fleur du Maquis", "description": "Fleur Du Maquis, meaning \"flower of the maquis\", is a Corsican cheese made from the milk of the Lacaune ewes."},
  {"name": "Flor de Guia", "description": "Flor de Guia cheese originated from Gran Canaria, the islands located in the Atlantic Ocean."},
  {"name": "Flower Marie", "description": "Made by Kevin and Alison Blunt of the Golden Cross Cheese at their Greenacres Farm, Flower Marie is a delicate little artisanal cheese made from sheep’s milk."},
  {"name": "Folded", "description": "There is no description."},
  {"name": "Folded cheese with mint", "description": "Folded cheese with a mint is a very typical Eastern Mediterranean cheese, which has become very popular in other parts of the world."},
  {"name": "Fondant de Brebis", "description": "A recent creation. This cheese has been made by the owner of a Parisian restaurant. It is principally produced with raw milk from ewes."},
  {"name": "Fontainebleau", "description": "Fontainebleau is a cream cheese that originated in a village near Foret de Fontainebleau in the Ile-de-France region of France."},
  {"name": "Fontal", "description": "Fontal is a semi-firm cheese made commercially in factories from pasteurized cow's milk."},
  {"name": "Fontina Val d'Aosta", "description": "Fontina Val d'Aosta is an Italian unpasteurized cow's milk cheese."},
  {"name": "Formaggio di capra", "description": "'Formaggio di capra' is Italian for 'goat's milk cheese'. It is tangy to taste and stark white in colour."},
  {"name": "Fougerus", "description": "Fougerus is a mold-ripened cow's milk cheese from Brie family produced by Rouzaire."},
  {"name": "Four Herb Gouda", "description": "Four Herb Gouda is a hard organic cheese made from unpasteurised cow's milk."},
  {"name": "Fourme d' Ambert", "description": "Fourme d'Ambert is a semi-hard French blue cheese."},
  {"name": "Fourme de Haute Loire", "description": "This cheese originally comes from the Rhône-Alpes region."},
  {"name": "Fourme de Montbrison", "description": "Fourme de Montbrison is one of the French AOC cheeses produced in Rhone-Alpes and Auvergne regions in Southern France."},
  {"name": "Fresh Jack", "description": "Fresh Jack is Monterey Jack cheese made from whole or skimmed milk and aged for only a week."},
  {"name": "Fresh Mozzarella", "description": "Fresh mozzarella is made with four simple ingredients: milk, rennet, citric acid, and salt. It's especially good made with whole milk—just make sure it's not ultra high temperature (UHT) pasteurized."},
  {"name": "Fresh Ricotta", "description": "There is no description."},
  {"name": "Fresh Truffles", "description": "There is no description."},
  {"name": "Fribourgeois", "description": "There is no description."},
  {"name": "Friesekaas", "description": "There is no description."}]